---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MassLevelData.IsEmpty
source: html/c9e0abfe-b8fa-e48b-edab-b83185b158fb.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.IsEmpty Method

Indicates if the MassLevelData (Mass Floor) has a geometrical representation. May not
 if the level does not intersect the mass geometry.

## Syntax (C#)
```csharp
public bool IsEmpty()
```

## Returns
Returns True if MassLevelData is dimensionless, False otherwise.